W4D5/app/models/user.rb

    def reset_session_token!
        self.session_token = User.generate_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "SR88GLYUs60B1JeSSts8sg"], ["updated_at", "2019-01-31 21:52:54.354331"], ["id", 1]]