Week 4 Rails/W4D5/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        # render json: user_params

        user = User.new(user_params)

        if user.save