W4D2/app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book = Book.find_by(id: params[:id])

INSERT INTO "books" ("title", "author", "year", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "cat"], ["author", "cato"], ["year", 1], ["description", "speech"], ["created_at", "2019-01-29 08:23:27.249050"], ["updated_at", "2019-01-29 08:23:27.249050"]]
---
  def create
    @book = Book.new(book_params)

    if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def edit
    @book = Book.find_by(id: params[:id])

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "books" SET "year" = $1, "description" = $2, "category" = $3, "updated_at" = $4 WHERE "books"."id" = $5  [["year", 234], ["description", "            speech\r\n        "], ["category", "Fiction"], ["updated_at", "2019-01-29 09:36:38.998546"], ["id", 11]]
---
  def update
    @book = Book.find_by(id: params[:id])

    if @book.update_attributes(book_params)