W4D5/app/controllers/application_controller.rb

    def current_user
        User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "SR88GLYUs60B1JeSSts8sg"], ["LIMIT", 1]]