W4D5/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "The Offspring"], ["created_at", "2019-02-01 00:39:47.036579"], ["updated_at", "2019-02-01 00:39:47.036579"]]
---
    def create
        band = Band.new(band_params)
        # Fail
        if band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "John"], ["updated_at", "2019-01-31 23:39:00.404099"], ["id", 1]]
---
    def update
        band = Band.find(params[:id])

        if band
            band.update(band_params)

SELECT  "bands".* FROM "bands" WHERE "bands"."name" = $1 LIMIT $2  [["name", "The Offspring"], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 14]]
---
    def destroy
        band = Band.find_by(name: params[:band][:name])
        if band == nil
            flash.now[:error] = "That which is dead can never die"
            redirect_to bands_url
        elsif band.destroy